<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"25aefbe5096857d29b899d34f998e6dcb8cbb046891e4e87d1d0377bc729ee82","plan_job_ref":"Job Terraform Plan #3 at https://github.com/cal-itp/gtfs.calitp.org/actions/runs/14715865760","plan_out_hash":"9491d8fec33bba1e417689f16735cd423e6b1077f6e373114acd7883b06fed25","plan_hash":"1335b36b85226ec6ca8057bd742cf5ccc4a5d1808413d30fa8ba9b9dbab546cb","plan_text_format":"diff","version":"1.48.0"} -->
Terraform plan in __iac/__
<details>
<summary>Plan: 3 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # google_storage_bucket_object.gtfs-calitp-org["favicon.ico"] will be created
+   resource "google_storage_bucket_object" "gtfs-calitp-org" {
+       bucket         = "calitp-gtfs"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "favicon.ico"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../src/favicon.ico"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.gtfs-calitp-org["index.html"] will be created
+   resource "google_storage_bucket_object" "gtfs-calitp-org" {
+       bucket         = "calitp-gtfs"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "index.html"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../src/index.html"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.gtfs-calitp-org["styles.css"] will be created
+   resource "google_storage_bucket_object" "gtfs-calitp-org" {
+       bucket         = "calitp-gtfs"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "styles.css"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../src/styles.css"
+       storage_class  = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan #3](https://github.com/cal-itp/gtfs.calitp.org/actions/runs/14715865760)